Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-EF_DFP/1.3.57/atdf/PIC32MZ2048EFM124.atdf
      <value-group caption="Configuration Mismatch Reset Flag bit" name="RCON__CMR">
         <value caption="A Configuration Mismatch Reset has occurred" name="" value="0x1"/>
         <value caption="A Configuration Mismatch Reset has not occurred" name="" value="0x0"/>
      </value-group>
      <value-group caption="Primary/Secondary Configuration Registers Error Flag bit" name="RCON__BCFGFAIL">
         <value caption="An error occurred during a read of the primary and alternate configuration registers" name="" value="0x1"/>
         <value caption="No error occurred during a read of the primary and alternate configuration registers" name="" value="0x0"/>
      </value-group>
      <value-group caption="Primary Configuration Registers Error Flag bit" name="RCON__BCFGERR">
         <value caption="An error occurred during a read of the primary configuration registers" name="" value="0x1"/>
         <value caption="No error occurred during a read of the primary configuration registers" name="" value="0x0"/>
      </value-group>
      <value-group caption="Software Reset Trigger bit" name="RSWRST__SWRST">
         <value caption="Enable software Reset event" name="" value="0x1"/>
         <value caption="No effect" name="" value="0x0"/>
      </value-group>
      <value-group caption="NMI Reset Counter Value bits" name="RNMICON__NMICNT">
         <value caption="65535 SYSCLK cycles before a device Reset occurs" name="" value="0xffff"/>
         <value caption="1 SYSCLK cycle before a device Reset occurs" name="" value="0x1"/>
         <value caption="No delay between NMI assertion and device Reset event" name="" value="0x0"/>
      </value-group>
      <value-group caption="Watchdog Timer Time-out in Sleep Mode Flag bit" name="RNMICON__WDTS">
         <value caption="WDT time-out has occurred during Sleep mode and caused a wake-up from sleep" name="" value="0x1"/>
         <value caption="WDT time-out has not occurred during Sleep mode" name="" value="0x0"/>
      </value-group>
      <value-group caption="Clock Fail Detect bit" name="RNMICON__CF">
         <value caption="FSCM has detected clock failure and caused an NMI" name="" value="0x1"/>
         <value caption="FSCM has not detected clock failure" name="" value="0x0"/>
      </value-group>
      <value-group caption="General NMI bit" name="RNMICON__GNMI">
         <value caption="A general NMI event has been detected or a user-initiated NMI event has occurred" name="" value="0x1"/>
         <value caption="A general NMI event has not been detected" name="" value="0x0"/>
      </value-group>
      <value-group caption="Software NMI Trigger" name="RNMICON__SWNMI">
         <value caption="An NMI will be generated" name="" value="0x1"/>
         <value caption="An NMI will not be generated" name="" value="0x0"/>
      </value-group>
      <value-group caption="Watchdog Timer Time-Out Flag bit" name="RNMICON__WDTO">
         <value caption="WDT time-out has occurred and caused a NMI" name="" value="0x1"/>
         <value caption="WDT time-out has not occurred" name="" value="0x0"/>
      </value-group>
      <value-group caption="Deadman Timer Time-out Flag bit" name="RNMICON__DMTO">
         <value caption="DMT time-out has occurred and caused a NMI" name="" value="0x1"/>
         <value caption="DMT time-out has not occurred" name="" value="0x0"/>
      </value-group>
      <value-group caption="Voltage Regulator Stand-by Enable bit" name="PWRCON__VREGS">
         <value caption="Voltage regulator will remain active during Sleep" name="" value="0x1"/>
         <value caption="Voltage regulator will go to Stand-by mode during Sleep" name="" value="0x0"/>
      </value-group>
   </module>
   <module caption="" id="00158" name="CRYPTO" version="1">
      <register-group name="CRYPTO">
         <register caption="Crypto Engine Revision" name="CEVER" offset="0x0" rw="R" size="4">
            <bitfield mask="0x0000FFFF" name="ID"/>
            <bitfield mask="0x00FF0000" name="VERSION"/>
            <bitfield mask="0xFF000000" name="REVISION"/>
         </register>
         <register caption="Crypto Engine Control Register" name="CECON" offset="0x4" rw="RW" size="4">
            <bitfield caption="DMA Enable bit" mask="0x00000001" name="DMAEN" values="CECON__DMAEN"/>
            <bitfield caption="Buffer Descriptor Processor Poll Enable bit" mask="0x00000002" name="BDPPLEN" values="CECON__BDPPLEN"/>
            <bitfield caption="Buffer Descriptor Processor Fetch Enable bit" mask="0x00000004" name="BDPCHST" values="CECON__BDPCHST"/>
            <bitfield caption="Input Data Swap Enable bit" mask="0x00000020" name="SWAPEN" values="CECON__SWAPEN"/>
            <bitfield caption="Software Reset bit" mask="0x00000040" name="SWRST" values="CECON__SWRST"/>
            <bitfield caption="Swap Output Data Enable bit" mask="0x00000080" name="SWAPOEN" values="CECON__SWAPOEN"/>
         </register>
         <register caption="Crypto Engine Buffer Descriptor Register" name="CEBDADDR" offset="0x8" rw="R" size="4">
            <bitfield mask="0xFFFFFFFF" name="BDPADDR"/>
         </register>
         <register caption="Crypto Engine Buffer Descriptor Processor Register" name="CEBDPADDR" offset="0xc" rw="R" size="4">
            <bitfield mask="0xFFFFFFFF" name="BASEADDR"/>
         </register>
         <register caption="Crypto Engine Status Register" name="CESTAT" offset="0x10" rw="R" size="4">
            <bitfield mask="0x0000FFFF" name="BDCTRL"/>
            <bitfield caption="Buffer Descriptor Processor Status bit" mask="0x00010000" name="ACTIVE" values="CESTAT__ACTIVE"/>
            <bitfield caption="DMA Start Status bit" mask="0x00020000" name="START" values="CESTAT__START"/>
            <bitfield caption="Buffer Descriptor Processor State Status bits" mask="0x003C0000" name="BDSTATE" values="CESTAT__BDSTATE"/>
            <bitfield caption="Internal Error Phase of DMA Status bits" mask="0x03000000" name="ERRPHASE" values="CESTAT__ERRPHASE"/>
            <bitfield caption="Internal Error Operation Status bits" mask="0x1C000000" name="ERROP" values="CESTAT__ERROP"/>
            <bitfield caption="Internal Error Mode Status bits" mask="0xE0000000" name="ERRMODE" values="CESTAT__ERRMODE"/>
         </register>
