Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-EF_DFP/1.3.57/atdf/PIC32MZ2048EFM124.atdf
         <register caption="Crypto Engine Interrupt Source Register" name="CEINTSRC" offset="0x14" rw="R" size="4">
            <bitfield caption="Crypto Engine Interrupt Pending Status bit" mask="0x00000001" name="PENDIF" values="CEINTSRC__PENDIF"/>
            <bitfield caption="BD Transmit Status bit" mask="0x00000002" name="CBDIF" values="CEINTSRC__CBDIF"/>
            <bitfield caption="DMA Packet Completion Interrupt Status bit" mask="0x00000004" name="PKTIF" values="CEINTSRC__PKTIF"/>
            <bitfield caption="Access Response Error Interrupt bit" mask="0x00000008" name="AREIF" values="CEINTSRC__AREIF"/>
         </register>
         <register caption="Crypto Engine Interrupt Enable Register" name="CEINTEN" offset="0x18" rw="RW" size="4">
            <bitfield caption="Master Interrupt Enable bit" mask="0x00000001" name="PENDIE" values="CEINTEN__PENDIE"/>
            <bitfield caption="DMA Buffer Descriptor Processor Interrupt Enable bit" mask="0x00000002" name="BDPIE" values="CEINTEN__BDPIE"/>
            <bitfield caption="DMA Packet Completion Interrupt Enable bit" mask="0x00000004" name="PKTIE" values="CEINTEN__PKTIE"/>
            <bitfield caption="Access Response Error Interrupt Enable bit" mask="0x00000008" name="AREIE" values="CEINTEN__AREIE"/>
         </register>
         <register caption="Crypto Engine Poll Control Register" name="CEPOLLCON" offset="0x1c" rw="RW" size="4">
            <bitfield mask="0x0000FFFF" name="BDPPLCON"/>
         </register>
         <register caption="Crypto Engine Header Length Register" name="CEHDLEN" offset="0x20" rw="RW" size="4">
            <bitfield mask="0x000000FF" name="HDRLEN"/>
         </register>
         <register caption="Crypto Engine Trailer Length Register" name="CETRLLEN" offset="0x24" rw="RW" size="4">
            <bitfield mask="0x000000FF" name="TRLRLEN"/>
         </register>
      </register-group>
      <value-group caption="DMA Enable bit" name="CECON__DMAEN">
         <value caption="Crypto Engine DMA is enabled" name="" value="0x1"/>
         <value caption="Crypto Engine DMA is disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Buffer Descriptor Processor Poll Enable bit" name="CECON__BDPPLEN">
         <value caption="Poll for descriptor until valid bit is set" name="" value="0x1"/>
         <value caption="Do not poll" name="" value="0x0"/>
      </value-group>
      <value-group caption="Buffer Descriptor Processor Fetch Enable bit" name="CECON__BDPCHST">
         <value caption="BDP descriptor fetch is enabled" name="" value="0x1"/>
         <value caption="BDP descriptor fetch is disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Input Data Swap Enable bit" name="CECON__SWAPEN">
         <value caption="Input data is byte swapped when read by dedicated DMA" name="" value="0x1"/>
         <value caption="Input data is not byte swapped when read by dedicated DMA" name="" value="0x0"/>
      </value-group>
      <value-group caption="Software Reset bit" name="CECON__SWRST">
         <value caption="Initiate a software reset of the Crypto Engine" name="" value="0x1"/>
         <value caption="Normal operation" name="" value="0x0"/>
      </value-group>
      <value-group caption="Swap Output Data Enable bit" name="CECON__SWAPOEN">
         <value caption="Output data is byte swapped when written by dedicated DMA" name="" value="0x1"/>
         <value caption="Output data is not byte swapped when written by dedicated DMA" name="" value="0x0"/>
      </value-group>
      <value-group caption="Buffer Descriptor Processor Status bit" name="CESTAT__ACTIVE">
         <value caption="BDP is active" name="" value="0x1"/>
         <value caption="BDP is idle" name="" value="0x0"/>
      </value-group>
      <value-group caption="DMA Start Status bit" name="CESTAT__START">
         <value caption="DMA start has occurred" name="" value="0x1"/>
         <value caption="DMA start has not occurred" name="" value="0x0"/>
      </value-group>
      <value-group caption="Buffer Descriptor Processor State Status bits" name="CESTAT__BDSTATE">
         <value caption="Reserved" name="" value="0xf"/>
         <value caption="Reserved" name="" value="0xe"/>
         <value caption="Reserved" name="" value="0xd"/>
         <value caption="Reserved" name="" value="0xc"/>
         <value caption="Reserved" name="" value="0xb"/>
         <value caption="Reserved" name="" value="0xa"/>
         <value caption="Reserved" name="" value="0x9"/>
         <value caption="Reserved" name="" value="0x8"/>
         <value caption="Reserved" name="" value="0x7"/>
         <value caption="SA fetch" name="" value="0x6"/>
         <value caption="Fetch BDP is disabled" name="" value="0x5"/>
         <value caption="Descriptor is done" name="" value="0x4"/>
         <value caption="Data phase" name="" value="0x3"/>
         <value caption="BDP is loading" name="" value="0x2"/>
         <value caption="Descriptor fetch request is pending" name="" value="0x1"/>
         <value caption="BDP is idle" name="" value="0x0"/>
      </value-group>
      <value-group caption="Internal Error Phase of DMA Status bits" name="CESTAT__ERRPHASE">
         <value caption="Destination data" name="" value="0x3"/>
         <value caption="Source data" name="" value="0x2"/>
         <value caption="Security Association (SA) access" name="" value="0x1"/>
         <value caption="Buffer Descriptor (BD) access" name="" value="0x0"/>
      </value-group>
      <value-group caption="Internal Error Operation Status bits" name="CESTAT__ERROP">
         <value caption="Reserved" name="" value="0x7"/>
         <value caption="Reserved" name="" value="0x6"/>
         <value caption="Reserved" name="" value="0x5"/>
         <value caption="Authentication" name="" value="0x4"/>
         <value caption="Reserved" name="" value="0x3"/>
         <value caption="Decryption" name="" value="0x2"/>
         <value caption="Encryption" name="" value="0x1"/>
         <value caption="Reserved" name="" value="0x0"/>
      </value-group>
      <value-group caption="Internal Error Mode Status bits" name="CESTAT__ERRMODE">
         <value caption="Reserved" name="" value="0x7L"/>
         <value caption="Reserved" name="" value="0x6L"/>
         <value caption="Reserved" name="" value="0x5L"/>
         <value caption="Reserved" name="" value="0x4L"/>
         <value caption="CEK operation" name="" value="0x3"/>
         <value caption="KEK operation" name="" value="0x2"/>
         <value caption="Preboot authentication" name="" value="0x1"/>
         <value caption="Normal operation" name="" value="0x0"/>
      </value-group>
