Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-EF_DFP/1.3.57/atdf/PIC32MZ2048EFM124.atdf
         <register caption="I2C Slave Address" name="I2C1ADD" offset="0x20" rw="RW" size="4">
            <bitfield mask="0x000003FF" name="I2CADD"/>
         </register>
         <register caption="I2C Slave Address" name="I2C2ADD" offset="0x220" rw="RW" size="4">
            <bitfield mask="0x000003FF" name="I2CADD"/>
         </register>
         <register caption="I2C Slave Address" name="I2C3ADD" offset="0x420" rw="RW" size="4">
            <bitfield mask="0x000003FF" name="I2CADD"/>
         </register>
         <register caption="I2C Slave Address" name="I2C4ADD" offset="0x620" rw="RW" size="4">
            <bitfield mask="0x000003FF" name="I2CADD"/>
         </register>
         <register caption="I2C Slave Address" name="I2C5ADD" offset="0x820" rw="RW" size="4">
            <bitfield mask="0x000003FF" name="I2CADD"/>
         </register>
         <register caption="I2C Address Mask" name="I2C1MSK" offset="0x30" rw="RW" size="4">
            <bitfield mask="0x000003FF" name="I2CMSK"/>
         </register>
         <register caption="I2C Address Mask" name="I2C2MSK" offset="0x230" rw="RW" size="4">
            <bitfield mask="0x000003FF" name="I2CMSK"/>
         </register>
         <register caption="I2C Address Mask" name="I2C3MSK" offset="0x430" rw="RW" size="4">
            <bitfield mask="0x000003FF" name="I2CMSK"/>
         </register>
         <register caption="I2C Address Mask" name="I2C4MSK" offset="0x630" rw="RW" size="4">
            <bitfield mask="0x000003FF" name="I2CMSK"/>
         </register>
         <register caption="I2C Address Mask" name="I2C5MSK" offset="0x830" rw="RW" size="4">
            <bitfield mask="0x000003FF" name="I2CMSK"/>
         </register>
         <register caption="I2C Baud Rate Generator" name="I2C1BRG" offset="0x40" rw="RW" size="4">
            <bitfield mask="0x0000FFFF" name="I2CBRG"/>
         </register>
         <register caption="I2C Baud Rate Generator" name="I2C2BRG" offset="0x240" rw="RW" size="4">
            <bitfield mask="0x0000FFFF" name="I2CBRG"/>
         </register>
         <register caption="I2C Baud Rate Generator" name="I2C3BRG" offset="0x440" rw="RW" size="4">
            <bitfield mask="0x0000FFFF" name="I2CBRG"/>
         </register>
         <register caption="I2C Baud Rate Generator" name="I2C4BRG" offset="0x640" rw="RW" size="4">
            <bitfield mask="0x0000FFFF" name="I2CBRG"/>
         </register>
         <register caption="I2C Baud Rate Generator" name="I2C5BRG" offset="0x840" rw="RW" size="4">
            <bitfield mask="0x0000FFFF" name="I2CBRG"/>
         </register>
         <register caption="" name="I2C1TRN" offset="0x50" rw="W" size="4">
            <bitfield mask="0x000000FF" name="I2CTRN"/>
         </register>
         <register caption="" name="I2C2TRN" offset="0x250" rw="W" size="4">
            <bitfield mask="0x000000FF" name="I2CTRN"/>
         </register>
         <register caption="" name="I2C3TRN" offset="0x450" rw="W" size="4">
            <bitfield mask="0x000000FF" name="I2CTRN"/>
         </register>
         <register caption="" name="I2C4TRN" offset="0x650" rw="W" size="4">
            <bitfield mask="0x000000FF" name="I2CTRN"/>
         </register>
         <register caption="" name="I2C5TRN" offset="0x850" rw="W" size="4">
            <bitfield mask="0x000000FF" name="I2CTRN"/>
         </register>
         <register caption="" name="I2C1RCV" offset="0x60" rw="R" size="4">
            <bitfield mask="0x000000FF" name="I2CRCV"/>
         </register>
         <register caption="" name="I2C2RCV" offset="0x260" rw="R" size="4">
            <bitfield mask="0x000000FF" name="I2CRCV"/>
         </register>
         <register caption="" name="I2C3RCV" offset="0x460" rw="R" size="4">
            <bitfield mask="0x000000FF" name="I2CRCV"/>
         </register>
         <register caption="" name="I2C4RCV" offset="0x660" rw="R" size="4">
            <bitfield mask="0x000000FF" name="I2CRCV"/>
         </register>
         <register caption="" name="I2C5RCV" offset="0x860" rw="R" size="4">
            <bitfield mask="0x000000FF" name="I2CRCV"/>
         </register>
      </register-group>
      <value-group caption="Start Condition Enable bit" name="I2C1CON__SEN">
         <value caption="Initiate Start condition on SDAx and SCLx pins. Hardware clear at end of master Start sequence." name="" value="0x1"/>
         <value caption="Start condition not in progress" name="" value="0x0"/>
      </value-group>
      <value-group caption="Repeated Start Condition Enable bit" name="I2C1CON__RSEN">
         <value caption="Initiate Repeated Start condition on SDAx and SCLx pins. Hardware clear at end of master Repeated Start sequence." name="" value="0x1"/>
         <value caption="Repeated Start condition not in progress" name="" value="0x0"/>
      </value-group>
      <value-group caption="Stop Condition Enable bit" name="I2C1CON__PEN">
         <value caption="Initiate Stop condition on SDAx and SCLx pins. Hardware clear at end of master Stop sequence." name="" value="0x1"/>
         <value caption="Stop condition not in progress" name="" value="0x0"/>
      </value-group>
      <value-group caption="Receive Enable bit" name="I2C1CON__RCEN">
         <value caption="Enables Receive mode for I2C. Hardware clear at end of eighth bit of master receive data byte." name="" value="0x1"/>
         <value caption="Receive sequence not in progress" name="" value="0x0"/>
      </value-group>
      <value-group caption="Acknowledge Sequence Enable bit" name="I2C1CON__ACKEN">
         <value caption="Initiate Acknowledge sequence on SDAx and SCLx pins and transmit ACKDT data bit. Hardware clear at end of master Acknowledge sequence." name="" value="0x1"/>
         <value caption="Acknowledge sequence not in progress" name="" value="0x0"/>
      </value-group>
      <value-group caption="Acknowledge Data bit" name="I2C1CON__ACKDT">
         <value caption="Send NACK during Acknowledge" name="" value="0x1"/>
         <value caption="Send ACK during Acknowledge" name="" value="0x0"/>
      </value-group>
