Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-EF_DFP/1.3.57/atdf/PIC32MZ2048EFM124.atdf
      <value-group caption="Test Mode Force Host Select bit" name="USBCSR3__FORCEHST">
         <value caption="Forces USB module into Host mode" name="" value="0x1L"/>
         <value caption="Normal operation" name="" value="0x0"/>
      </value-group>
      <value-group caption="FIFO Not Empty status bit" name="USBIENCSR0__FIFONE">
         <value caption="There is at least 1 packet in the TX FIFO" name="" value="0x1"/>
         <value caption="TX FIFO is empty" name="" value="0x0"/>
      </value-group>
      <value-group caption="Underrun status bit" name="USBIENCSR0__ERROR">
         <value caption="Meaning of bitfield depends on Host / Device mode of operation." name="" value="0x1"/>
         <value caption="Meaning of bitfield depends on Host / Device mode of operation." name="" value="0x0"/>
      </value-group>
      <value-group caption="FIFO Flush control bit" name="USBIENCSR0__FLUSH">
         <value caption="Flush the latest packet from the endpoint TX FIFO. The FIFO pointer is reset" name="" value="0x1"/>
         <value caption="Do not flush the FIFO" name="" value="0x0"/>
      </value-group>
      <value-group caption="STALL handshake transmission control bit" name="USBIENCSR0__SETUPPKT">
         <value caption="Meaning of bitfield depends on Host / Device mode of operation" name="" value="0x1"/>
         <value caption="Meaning of bitfield depends on Host / Device mode of operation" name="" value="0x0"/>
      </value-group>
      <value-group caption="STALL handshake transmission status bit" name="USBIENCSR0__RXSTALL">
         <value caption="Meaning of bitfield depends on Host / Device mode of operation." name="" value="0x1"/>
         <value caption="Meaning of bitfield depends on Host / Device mode of operation" name="" value="0x0"/>
      </value-group>
      <value-group caption="Clear Data Toggle Control bit" name="USBIENCSR0__CLRDT">
         <value caption="Resets the endpoint data toggle to 0" name="" value="0x1"/>
         <value caption="Do not clear the data toggle" name="" value="0x0"/>
      </value-group>
      <value-group caption="Incomplete TX Status bit" name="USBIENCSR0__NAKTMOUT">
         <value caption="Meaning of bitfield depends on Host / Device mode of operation." name="" value="0x1"/>
         <value caption="Meaning of bitfield depends on Host / Device mode of operation." name="" value="0x0"/>
      </value-group>
      <value-group caption="Endpoint DMA Request Mode Control bit" name="USBIENCSR0__DMAREQMD">
         <value caption="DMA Request Mode 1" name="" value="0x1"/>
         <value caption="DMA Request Mode 0" name="" value="0x0"/>
      </value-group>
      <value-group caption="Force Endpoint Data Toggle Control bit" name="USBIENCSR0__FRCDATTG">
         <value caption="Forces the endpoint data toggle to switch and the data packet to be cleared from the FIFO" name="" value="0x1"/>
         <value caption="No forced behavior" name="" value="0x0"/>
      </value-group>
      <value-group caption="Endpoint DMA Request Enable bit" name="USBIENCSR0__DMAREQEN">
         <value caption="DMA requests are enabled for this endpoint" name="" value="0x1"/>
         <value caption="DMA requests are disabled for this endpoint" name="" value="0x0"/>
      </value-group>
      <value-group caption="Endpoint Direction Control bit" name="USBIENCSR0__MODE">
         <value caption="Endpoint is TX" name="" value="0x1"/>
         <value caption="Endpoint is RX" name="" value="0x0"/>
      </value-group>
      <value-group caption="Auto Set Control bit" name="USBIENCSR0__AUTOSET">
         <value caption="TXPKTRDY will be automatically set when data of the maximum packet size (value in TXMAXP) is loaded into the TX FIFO. If a packet of less than the maximum packet size is loaded" name="" value="0x1L"/>
         <value caption="TXPKTRDY must be set manually for all packet sizes" name="" value="0x0"/>
      </value-group>
      <value-group caption="Isochronous TX Endpoint Enable bit" name="USBIENCSR0__ISO">
         <value caption="Enables the endpoint for Isochronous transfers" name="" value="0x40000000"/>
         <value caption="Disables the endpoint for Isochronous transfers and enables it for Bulk or Interrupt transfers." name="" value="0x0"/>
      </value-group>
      <value-group caption="Data Packet Reception Status bit" name="USBIENCSR1__RXPKTRDY">
         <value caption="A data packet has been received. An interrupt is generated." name="" value="0x1"/>
         <value caption="Written by software to clear this bit when the packet has been unloaded from the RX FIFO." name="" value="0x0"/>
      </value-group>
      <value-group caption="FIFO Full Status bit" name="USBIENCSR1__FIFOFULL">
         <value caption="No more packets can be loaded into the RX FIFO" name="" value="0x1"/>
         <value caption="The RX FIFO has at least one free space" name="" value="0x0"/>
      </value-group>
      <value-group caption="Data Overrun Status bit" name="USBIENCSR1__ERROR">
         <value caption="Meaning of bitfield depends on Host / Device mode of operation" name="" value="0x1"/>
         <value caption="Meaning of bitfield depends on Host / Device mode of operation" name="" value="0x0"/>
      </value-group>
      <value-group caption="Data Packet Error Status bit" name="USBIENCSR1__DERRNAKT">
         <value caption="Meaning of bitfield depends on Host / Device mode of operation." name="" value="0x1"/>
         <value caption="Meaning of bitfield depends on Host / Device mode of operation" name="" value="0x0"/>
      </value-group>
      <value-group caption="Flush FIFO Control bit" name="USBIENCSR1__FLUSH">
         <value caption="Flush the next packet to be read from the endpoint RX FIFO. The FIFO pointer is reset and the RXPKTRDY bit is cleared. This should only be used when RXPKTRDY is set. If the FIFO is double-buffered" name="" value="0x1"/>
         <value caption="Normal FIFO operation" name="" value="0x0"/>
      </value-group>
      <value-group caption="STALL Handshake Control bit" name="USBIENCSR1__REQPKT">
         <value caption="Meaning of bitfield depends on Host / Device mode of operation" name="" value="0x1"/>
         <value caption="Meaning of bitfield depends on Host / Device mode of operation" name="" value="0x0"/>
      </value-group>
      <value-group caption="STALL Handshake Status bit" name="USBIENCSR1__RXSTALL">
         <value caption="Meaning of bitfield depends on Host / Device mode of operation" name="" value="0x1"/>
         <value caption="Meaning of bitfield depends on Host / Device mode of operation" name="" value="0x0"/>
      </value-group>
      <value-group caption="Clear Data Toggle Control bit" name="USBIENCSR1__CLRDT">
         <value caption="Reset the endpoint data toggle to 0" name="" value="0x1"/>
         <value caption="Leave endpoint data toggle alone" name="" value="0x0"/>
      </value-group>
      <value-group caption="Incomplete Packet Status bit" name="USBIENCSR1__INCOMPRX">
         <value caption="The packet in the RX FIFO during a high-bandwidth Isochronous/Interrupt transfer is incomplete because parts of the data were not received" name="" value="0x1"/>
         <value caption="Written by then software to clear this bit" name="" value="0x0"/>
      </value-group>
      <value-group caption="Data Toggle Write Enable Control bit (" name="USBIENCSR1__DATATWEN">
         <value caption="DATATGGL can be written" name="" value="0x1"/>
         <value caption="DATATGGL is not writable" name="" value="0x0"/>
      </value-group>
      <value-group caption="DMA Request Mode Selection bit" name="USBIENCSR1__DMAREQMD">
         <value caption="DMA Request Mode 1" name="" value="0x1"/>
         <value caption="DMA Request Mode 0" name="" value="0x0"/>
      </value-group>
      <value-group caption="Disable NYET Handshakes Control/PID Error Status bit" name="USBIENCSR1__PIDERR">
         <value caption="Meaning of bitfield depends on Host / Device mode of operation." name="" value="0x1"/>
         <value caption="Meaning of bitfield depends on Host / Device mode of operation." name="" value="0x0"/>
      </value-group>
